#!/usr/bin/env python
# -*- coding: utf-8 -*-

moraic_kana = [
# hiragana
'あ',	'い',	'う',	'え',	'お',	
'か',	'き',	'く',	'け',	'こ',	
'が',	'ぎ',	'ぐ',	'げ',	'ご',	
'さ',	'し',	'す',	'せ',	'そ',	
'ざ',	'じ',	'ず',	'ぜ',	'ぞ',	
'た',	'ち',	'つ',	'て',	'と',	
'だ',	'ぢ',	'づ',	'で',	'ど',	
'な',	'に',	'ぬ',	'ね',	'の',	
'は',	'ひ',	'ふ',	'へ',	'ほ',	
'ば',	'び',	'ぶ',	'べ',	'ぼ',	
'ぱ',	'ぴ',	'ぷ',	'ぺ',	'ぽ',	
'ま',	'み',	'む',	'め',	'も',	
'や',			'ゆ',			'よ',	
'ら',	'り',	'る',	'れ',	'ろ',	
'わ',	'ゐ',	'ゑ',	'を',	
				'ん',	
# katakana
'ア',	'イ',	'ウ',	'エ',	'オ',	
'カ',	'キ',	'ク',	'ケ',	'コ',	
'ガ',	'ギ',	'グ',	'ゲ',	'ゴ',	
'サ',	'シ',	'ス',	'セ',	'ソ',	
'ザ',	'ジ',	'ズ',	'ゼ',	'ゾ',	
'タ',	'チ',	'ツ',	'テ',	'ト',	
'ダ',	'ヂ',	'ヅ',	'デ',	'ド',	
'ナ',	'ニ',	'ヌ',	'ネ',	'ノ',	
'ハ',	'ヒ',	'フ',	'ヘ',	'ホ',	
'バ',	'ビ',	'ブ',	'ベ',	'ボ',	
'パ',	'ピ',	'プ',	'ペ',	'ポ',	
'マ',	'ミ',	'ム',	'メ',	'モ',	
'ヤ',			'ユ',			'ヨ',	
'ラ',	'リ',	'ル',	'レ',	'ロ',	
'ワ',	'ヰ',	'ヱ',	'ヲ',	
				'ン',	
]

def count_morae(word):
	decoded_word = word.decode('utf-8')
	num_morae = 0
	for kana in decoded_word:
		if kana.encode('utf-8') in moraic_kana: num_morae += 1
	return num_morae

word = raw_input("word:")
print "num morae:",	 count_morae(word)